# Задача «Минимум из двух чисел»
# Условие
# Даны два целых числа. Выведите значение наименьшего из них.
# Во всех задачах считывайте входные данные через input() и выводите ответ через print().

a,b=input(),input()
if a > b:
    print(b)
else:
    print(a)
