# Задача «Сумма трёх чисел»
# Условие
# Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.

# Можете ли вы изменить её, чтобы она складывала три числа?
a = int(input())
b = int(input())
c = int(input())
print(a + b + c)