# Задача «Hello, Harry!»
# Условие
# Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:
# Во всех задачах считывайте входные данные через input() и выводите ответ через print().

name = input()
print("Hello, " + name + "!" )